# 테트로미노
# 브루트포스 알고리즘
# 회전이나 대칭을 시켜도 된다.
import sys

input = sys.stdin.readline

n, m = map(int, input().split())
graph = [list(map(int, input().split())) for _ in range(n)]
boxes = [
    # I
    [(0, 0),(0, 1),(0, 2),(0, 3)],
    [(0, 0),(1, 0),(2, 0),(3, 0)],
    # 네모
    [(0, 0), (0, 1), (1, 0), (1, 1)],
    # ㄴ
    [(0, 0), (1, 0), (2, 0), (2, 1)],
    [(0, 0), (0, 1), (0, 2), (1, 0)],
    [(0, 0), (0, 1), (1, 1), (2, 1)],
    [(1, 0), (1, 1), (1, 2), (0, 2)],
    [(2, 0), (0, 1), (1, 1), (2, 1)],
    [(0, 0), (1, 0), (1, 1), (1, 2)],
    [(0, 0), (1, 0), (2, 0), (0, 1)],
    [(0, 0), (0, 1), (0, 2), (1, 2)],
    # S
    [(0, 0), (1, 0), (1, 1), (2, 1)],
    [(1, 0), (1, 1), (0, 1), (0, 2)],
    [(0, 1), (1, 1), (1, 0), (2, 0)],
    [(0, 0), (0, 1), (1, 1), (1, 2)],
    # ㅜ
    [(0, 0), (0, 1), (0, 2), (1, 1)],
    [(1, 0), (0, 1), (1, 1), (2, 1)],
    [(0, 1), (1, 0), (1, 1), (1, 2)],
    [(0, 0), (1, 0), (2, 0), (1, 1)],
]

k = 0

def calculator(x, y, z):
    for box in boxes:
        t = 0

        for w in range(4):
            tx = x + box[w][0]
            ty = y + box[w][1]

            if 0 <= tx < n and 0 <= ty < m:
                t += graph[tx][ty]
            else:
                break

        z = max(z, t)

    return z

for i in range(n):
    for j in range(m):
        k = calculator(i, j, k)

print(k)
